package lesson20231115;

public class MinCost {

/*
    Самый дешёвый путь
    В каждой клетке прямоугольной таблицы N*M записано некоторое число.
    Изначально игрок находится в левой верхней клетке.
    За один ход ему разрешается перемещаться в соседнюю клетку либо вправо, либо вниз
    (влево и вверх перемещаться запрещено).
    При проходе через клетку игрок платит определенную сумму, значение которой записано в этой клетке.
    Требуется найти минимальную стоимость пути, отдав которую игрок может попасть в правый нижний угол.
 */

    public static void main(String[] args) {
        int[][] costs = new int[][]{{0, 1, 4, 4},
                                    {4, 1, 1, 1},
                                    {4, 4, 4, 1},
                                    {4, 4, 4, 0}};
        System.out.println(minCost(costs));
    }

    public static int minCost(int[][] costs) { // TODO
        return 0;
    }


}
